# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager


# Development
tap 'oven-sh/bun'
brew 'bun'

# Apps
cask 'arc'
cask 'boop'
cask 'chatgpt'
cask 'cherry-studio'
cask 'claude'
cask 'claude-code'
cask 'contexts'
cask 'discord'
cask 'figma'
cask 'flameshot'
cask 'github'
cask 'iterm2'
cask 'jan'
cask 'kiro'
cask 'loom'
cask 'lunacy'
cask 'lunatask'
cask 'mos'
cask 'obsidian'
cask 'orbstack'
cask 'pearcleaner'
cask 'raycast'
cask 'screen-studio'
cask 'sketch'
cask 'slack'
cask 'ticktick'
cask 'tableplus'
cask 'transmission'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'windsurf'
cask 'zoom'
cask 'zoxide'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'Dato', id: 1470584107