# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager


# Development
brew 'oven-sh/bun/bun'

# Apps
cask 'arc'
cask 'discord'
cask 'figma'
cask 'github'
cask 'loom'
cask 'orbstack'
cask 'raycast'
cask 'screen-studio'
cask 'slack'
cask 'tableplus'
cask 'visual-studio-code'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store